crawler.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>crawler</title>
<!-- 2013-10-02 Ср. 00:15 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="pimiento" />
</head>
<body>
<div id="content">
<h1 class="title">crawler</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Основная идея</a></li>
<li><a href="#sec-2">2. Реализация</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Основная идея</h2>
<div class="outline-text-2" id="text-1">
<p>
Необходимо собрать все задачи с <a href="http://acm.timus.ru/problemset.aspx">timus.ru</a>
и представить их в виде org-файла (timus.org).
</p>
<ul class="org-ul">
<li>Структура каждой задачи должны быть вида:
<div class="org-src-container">

<pre class="src src-org"><span style="color: #DFAF8F;">* {TODO|DONE} &#1080;&#1084;&#1103;-&#1079;&#1072;&#1076;&#1072;&#1095;&#1080;                                        </span><span style="color: #DFAF8F; font-weight: bold;">:&#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;:</span>
  &#1090;&#1077;&#1082;&#1089;&#1090; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103;

  org-babel &#1074;&#1089;&#1090;&#1072;&#1074;&#1082;&#1072; &#1089; curl-&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1084; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1082;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; tasknum_timus.py
</pre>
</div>
</li>

<li>Создать для каждой задачи файл tasknum_timus.org с содержанием
<div class="org-src-container">

<pre class="src src-org" id="tasknum_timus">&#1058;&#1077;&#1082;&#1089;&#1090; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;

<span style="color: #ff4500;">#+name: &#1080;&#1084;&#1103;_&#1079;&#1072;&#1076;&#1072;&#1095;&#1080;</span>
<span style="color: #ff4500;">#+begin_src python :results output :shebang "#!/usr/bin/env python3" :tangle $ta</span><span style="color: #DC8CC3; background-color: #3F3F3F;">sknum_timus.py</span>

<span style="color: #ff4500;">#+end_src</span>
</pre>
</div>
</li>
<li>Ключ для обновления только основного файла, не трогающий файлы решений
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Реализация</h2>
<div class="outline-text-2" id="text-2">
<p>
Даные мы будем получать со страницы с таблицей задач
</p>
<div class="org-src-container">

<pre class="src src-python" id="crawler"><span style="color: #00ffff; font-weight: bold;">import</span> re
<span style="color: #00ffff; font-weight: bold;">import</span> os
<span style="color: #00ffff; font-weight: bold;">import</span> urllib
<span style="color: #00ffff; font-weight: bold;">import</span> urllib2
<span style="color: #00ffff; font-weight: bold;">import</span> logging
<span style="color: #00ffff; font-weight: bold;">from</span> lxml <span style="color: #00ffff; font-weight: bold;">import</span> html
<span style="color: #00ffff; font-weight: bold;">from</span> cookielib <span style="color: #00ffff; font-weight: bold;">import</span> CookieJar

<span style="color: #eedd82;">TASKS_URL</span> = <span style="color: #ffa07a;">"http://acm.timus.ru/problemset.aspx?page=all"</span>
<span style="color: #eedd82;">AUTH_URL</span> = <span style="color: #ffa07a;">"http://acm.timus.ru/authedit.aspx"</span>
<span style="color: #eedd82;">CONFIG_PATH</span> = <span style="color: #ffa07a;">"./crawler.conf"</span>

logging.basicConfig(filename=<span style="color: #ffa07a;">'/tmp/logfile.txt'</span>, level=logging.DEBUG,
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #b0c4de;">format</span>=<span style="color: #ffa07a;">'%(asctime)s - %(levelname)s - %(message)s'</span>)

<span style="color: #00ffff; font-weight: bold;">def</span> <span style="color: #87cefa;">get_secrets</span>():
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">if</span> os.path.isfile(CONFIG_PATH):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">with</span> <span style="color: #b0c4de;">open</span>(CONFIG_PATH, <span style="color: #ffa07a;">'r'</span>) <span style="color: #00ffff; font-weight: bold;">as</span> fd:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   config = fd.readlines()
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">return</span> parse_config(config)
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">raise</span> <span style="color: #98fb98;">IOError</span>(<span style="color: #ffa07a;">"%s is absent!"</span> % CONFIG_PATH)

<span style="color: #00ffff; font-weight: bold;">def</span> <span style="color: #87cefa;">parse_config</span>(config):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   JUDGE_ID = <span style="color: #ffa07a;">""</span>
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   PASSWORD = <span style="color: #ffa07a;">""</span>
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   judgeid_regexp = re.compile(r<span style="color: #ffa07a;">'^JUDGE_ID'</span>)
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   password_regexp = re.compile(r<span style="color: #ffa07a;">'^PASSWORD'</span>)
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   comment_regexp = re.compile(r<span style="color: #ffa07a;">'^#'</span>)
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">for</span> line <span style="color: #00ffff; font-weight: bold;">in</span> config:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">if</span> comment_regexp.match(line):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">continue</span>
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">if</span> judgeid_regexp.match(line):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   JUDGE_ID = line.split(<span style="color: #ffa07a;">':'</span>)[1].strip()
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">if</span> password_regexp.match(line):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   PASSWORD = line.split(<span style="color: #ffa07a;">':'</span>)[1].strip()
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">return</span> JUDGE_ID, PASSWORD

<span style="color: #00ffff; font-weight: bold;">try</span>:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   JUDGE_ID, PASSWORD = get_secrets()
<span style="color: #00ffff; font-weight: bold;">except</span> <span style="color: #98fb98;">IOError</span>, e:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   JUDGE_ID = <span style="color: #ffa07a;">"MYID"</span>
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   PASSWORD = <span style="color: #ffa07a;">"PASSWORD"</span>


<span style="color: #00ffff; font-weight: bold;">def</span> <span style="color: #87cefa;">fill_dict</span>(task):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   status, num, name, <span style="color: #b0c4de;">_</span>, <span style="color: #b0c4de;">_</span>, price = task.getchildren()
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">if</span> status.find(<span style="color: #ffa07a;">'a'</span>):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   status = <span style="color: #ffa07a;">'ok.gif'</span> <span style="color: #00ffff; font-weight: bold;">in</span> status.find(<span style="color: #ffa07a;">'a'</span>).find(<span style="color: #ffa07a;">'img'</span>).attrib.get(<span style="color: #ffa07a;">'src'</span>)
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">else</span>:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   status = <span style="color: #00ffff; font-weight: bold;">False</span>
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">return</span> {num.text_content(): [status, name.text_content(), price.text_content<span style="color: #DC8CC3; background-color: #3F3F3F;">()]}</span>

<span style="color: #eedd82;">cj</span> = CookieJar()
<span style="color: #eedd82;">opener</span> = urllib2.build_opener(urllib2.HTTPCookieProcessor(cj))
opener.addheaders.append((<span style="color: #ffa07a;">'Cookie'</span>, <span style="color: #ffa07a;">'Locale=Russian'</span>))
<span style="color: #eedd82;">data</span> = urllib.urlencode({<span style="color: #ffa07a;">"Action"</span>: <span style="color: #ffa07a;">"edit"</span>,
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>    <span style="color: #ffa07a;">"JudgeID"</span>: JUDGE_ID,
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>    <span style="color: #ffa07a;">"Password"</span>: PASSWORD})
<span style="color: #eedd82;">response</span> = opener.open(AUTH_URL, data)

<span style="color: #eedd82;">fd</span> = opener.open(TASKS_URL)

<span style="color: #eedd82;">doc</span> = html.fromstring(fd.read())

<span style="color: #eedd82;">tasks_list</span> = doc.body.find_class(<span style="color: #ffa07a;">'content'</span>)

<span style="color: #eedd82;">tasks_dict</span> = {}
<span style="color: #00ffff; font-weight: bold;">for</span> task <span style="color: #00ffff; font-weight: bold;">in</span> tasks_list:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">if</span> task[0].tag == <span style="color: #ffa07a;">'th'</span>:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">continue</span>
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   tasks_dict.update(fill_dict(task))

<span style="color: #00ffff; font-weight: bold;">for</span> task <span style="color: #00ffff; font-weight: bold;">in</span> tasks_dict:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   logging.debug(u<span style="color: #ffa07a;">'%s: %s'</span> % (task, tasks_dict[task]))
</pre>
</div>

<p>
Подготовим возможность логгировать ход выполения нашего скрипта
</p>
<div class="org-src-container">

<pre class="src src-python" id="logging">logging.basicConfig(filename=<span style="color: #ffa07a;">'/tmp/logfile.txt'</span>, level=logging.DEBUG,
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #b0c4de;">format</span>=<span style="color: #ffa07a;">'%(asctime)s - %(levelname)s - %(message)s'</span>)
</pre>
</div>

<p>
Чтобы знать именно наши результаты,
нужно сначала авторизоваться в системе и получить нужные куки,
но сначала надо получить наши логин и пароль, если мы указали их в отдельном файле
</p>
<div class="org-src-container">

<pre class="src src-python" id="get_secrets"><span style="color: #00ffff; font-weight: bold;">def</span> <span style="color: #87cefa;">get_secrets</span>():
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">if</span> os.path.isfile(CONFIG_PATH):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">with</span> <span style="color: #b0c4de;">open</span>(CONFIG_PATH, <span style="color: #ffa07a;">'r'</span>) <span style="color: #00ffff; font-weight: bold;">as</span> fd:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   config = fd.readlines()
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">return</span> parse_config(config)
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">raise</span> <span style="color: #98fb98;">IOError</span>(<span style="color: #ffa07a;">"%s is absent!"</span> % CONFIG_PATH)

<span style="color: #00ffff; font-weight: bold;">def</span> <span style="color: #87cefa;">parse_config</span>(config):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   JUDGE_ID = <span style="color: #ffa07a;">""</span>
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   PASSWORD = <span style="color: #ffa07a;">""</span>
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   judgeid_regexp = re.compile(r<span style="color: #ffa07a;">'^JUDGE_ID'</span>)
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   password_regexp = re.compile(r<span style="color: #ffa07a;">'^PASSWORD'</span>)
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   comment_regexp = re.compile(r<span style="color: #ffa07a;">'^#'</span>)
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">for</span> line <span style="color: #00ffff; font-weight: bold;">in</span> config:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">if</span> comment_regexp.match(line):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">continue</span>
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">if</span> judgeid_regexp.match(line):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   JUDGE_ID = line.split(<span style="color: #ffa07a;">':'</span>)[1].strip()
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">if</span> password_regexp.match(line):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   PASSWORD = line.split(<span style="color: #ffa07a;">':'</span>)[1].strip()
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">return</span> JUDGE_ID, PASSWORD

<span style="color: #00ffff; font-weight: bold;">try</span>:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   JUDGE_ID, PASSWORD = get_secrets()
<span style="color: #00ffff; font-weight: bold;">except</span> <span style="color: #98fb98;">IOError</span>, e:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   JUDGE_ID = <span style="color: #ffa07a;">"MYID"</span>
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   PASSWORD = <span style="color: #ffa07a;">"PASSWORD"</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python" id="get_cookies"><span style="color: #eedd82;">cj</span> = CookieJar()
<span style="color: #eedd82;">opener</span> = urllib2.build_opener(urllib2.HTTPCookieProcessor(cj))
opener.addheaders.append((<span style="color: #ffa07a;">'Cookie'</span>, <span style="color: #ffa07a;">'Locale=Russian'</span>))
<span style="color: #eedd82;">data</span> = urllib.urlencode({<span style="color: #ffa07a;">"Action"</span>: <span style="color: #ffa07a;">"edit"</span>,
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>    <span style="color: #ffa07a;">"JudgeID"</span>: JUDGE_ID,
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>    <span style="color: #ffa07a;">"Password"</span>: PASSWORD})
<span style="color: #eedd82;">response</span> = opener.open(AUTH_URL, data)
</pre>
</div>

<p>
Получаем сырой xhtml
</p>
<div class="org-src-container">

<pre class="src src-python" id="get_data"><span style="color: #eedd82;">fd</span> = opener.open(TASKS_URL)
</pre>
</div>

<p>
И затем скармливаем его lxml и получаем тело страницы
</p>
<div class="org-src-container">

<pre class="src src-python" id="to_xml"><span style="color: #eedd82;">doc</span> = html.fromstring(fd.read())
</pre>
</div>

<p>
Каждая запись задачи хранится в элементе tr с классом <i>content</i>
</p>
<div class="org-src-container">

<pre class="src src-python" id="get_content"><span style="color: #eedd82;">tasks_list</span> = doc.body.find_class(<span style="color: #ffa07a;">'content'</span>)
</pre>
</div>

<p>
Мы будем хранить наши записи в дикте вида
{Номер: [статус(True|False), название(String), стоимость(Integer)]}
Среди прочих нам попадётся строчка таблицы заголовок, её нужно пропустить
</p>
<div class="org-src-container">

<pre class="src src-python" id="create_dict"><span style="color: #eedd82;">tasks_dict</span> = {}
<span style="color: #00ffff; font-weight: bold;">for</span> task <span style="color: #00ffff; font-weight: bold;">in</span> tasks_list:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">if</span> task[0].tag == <span style="color: #ffa07a;">'th'</span>:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">continue</span>
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   tasks_dict.update(fill_dict(task))
</pre>
</div>

<p>
Заполнять задачи будем в следующем порядке:
</p>
<ol class="org-ol">
<li>Если в первом <i>td</i> содержится изображение "ok.gif" &#x2013; задача выполнена
</li>
<li>Второй <i>td</i> содержит номер задачи
</li>
<li>Третий <i>td</i> содержит название задачи
</li>
<li>Четвёртый и пятый <i>td</i> мы пропускаем
</li>
<li>Пятый <i>td</i> содержит стоимость задания
</li>
</ol>

<div class="org-src-container">

<pre class="src src-python" id="fill_dict"><span style="color: #00ffff; font-weight: bold;">def</span> <span style="color: #87cefa;">fill_dict</span>(task):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   status, num, name, <span style="color: #b0c4de;">_</span>, <span style="color: #b0c4de;">_</span>, price = task.getchildren()
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">if</span> status.find(<span style="color: #ffa07a;">'a'</span>):
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   status = <span style="color: #ffa07a;">'ok.gif'</span> <span style="color: #00ffff; font-weight: bold;">in</span> status.find(<span style="color: #ffa07a;">'a'</span>).find(<span style="color: #ffa07a;">'img'</span>).attrib.get(<span style="color: #ffa07a;">'src'</span>)
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">else</span>:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   status = <span style="color: #00ffff; font-weight: bold;">False</span>
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #00ffff; font-weight: bold;">return</span> {num.text_content(): [status, name.text_content(), price.text_content<span style="color: #DC8CC3; background-color: #3F3F3F;">()]}</span>
</pre>
</div>

<p>
Осталось записать результат в org-file
</p>
<div class="org-src-container">

<pre class="src src-python" id="create_org"><span style="color: #00ffff; font-weight: bold;">for</span> task <span style="color: #00ffff; font-weight: bold;">in</span> tasks_dict:
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   logging.debug(u<span style="color: #ffa07a;">'%s: %s'</span> % (task, tasks_dict[task]))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pimiento</p>
<p class="date">Created: 2013-10-02 Ср. 00:15</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.1.1 (<a href="http://orgmode.org">Org</a> mode 8.1.2)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
